Revit 2027 API
BuiltInFailures.MEPCalculationFailures.HydraulicSeparationOfOneSystem Property
 Unable to hydraulically separate the loop when both supply and return are assigned to the same system. Try again with both start and end selected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HydraulicSeparationOfOneSystem { get; }
Public Shared ReadOnly Property HydraulicSeparationOfOneSystem As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HydraulicSeparationOfOneSystem {
	FailureDefinitionId^ get ();
}
static member HydraulicSeparationOfOneSystem : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace